//---------------------------------------------------------------------------
#ifndef MatrosovaH
#define MatrosovaH
//---------------------------------------------------------------------------
#include "Cp_types.h"
#include "Target.h"
#include "MyMissile.h"     // Ракета

//------------------Описание класса CMatrosova-------------------------------
//Назначение: демонстрация работы АРГС в составе системы самонаведения
//ракеты
class CMatrosova : public CTaskBase
{
public:
   //-------------------------Методы класса--------------------------------------
   //Конструктор класса
    CMatrosova(int li_Level, std::wstring lc_String);
   //Деструктор класса
    virtual ~CMatrosova();
    void init_struct();
    void set_inputs();   // Передача

private:
//------------------Данные класса--------------------------------------------
    CMyMissile* missile; // Ракета
};
//---------------------------------------------------------------------------
#endif
